package practice;
/*
백준 1931: 회의실 배정
1. 입력 받기: int N = scanner.nextInt();와 이후의 for 루프를 통해 사용자로부터 회의의 수(N)와 각 회의의 시작 시간과 종료 시간을 입력받습니다. 각 회의의 시간 정보는 2차원 배열 meetings에 저장됩니다.
2. 정렬하기: Arrays.sort(meetings, (o1, o2) -> {...}); 을 사용하여 meetings 배열을 가장 먼저 끝나는 회의부터 정렬합니다. 만약 두 회의가 동시에 끝나면, 먼저 시작하는 회의를 앞에 둡니다.
3. 회의 스케줄링: for (int i = 0; i < N; i++) {...} 루프를 사용하여 각 회의를 검사합니다. 현재 회의의 시작 시간이 마지막으로 스케줄링된 회의의 종료 시간보다 늦거나 같으면, 이 회의를 스케줄에 추가하고 count를 1 증가시킵니다. 추가된 회의의 종료 시간은 endTime에 업데이트 됩니다.
4. 결과 출력: System.out.println(count);를 사용하여 가능한 최대 회의 수를 출력합니다.
 */

public class B1931 {
}
