package practice;
/*
백준21758: 꿀 따기
1. 입력 받기: honey 배열에는 각 셀에서 수확할 수 있는 꿀의 양이 저장됩니다. sum 배열에는 1번부터 i번째 셀까지 꿀의 누적 합계가 저장됩니다.
2. bBT 메소드: 이 메소드는 첫 번째 벌이 첫 번째 셀부터 시작하고, 특정 지점에서 두 번째 벌이 시작하는 경우를 계산합니다. 이 때, 두 번째 벌이 시작할 수 있는 지점은 2번 셀부터 n-1번 셀까지입니다.
3. tBB 메소드: 이 메소드는 첫 번째 벌이 n-1번 셀부터 시작하고, 두 번째 벌이 특정 지점에서 시작하는 경우를 계산합니다. 두 번째 벌이 시작할 수 있는 지점도 마찬가지로 2번 셀부터 n-1번 셀까지입니다.
4. bTB 메소드: 이 메소드는 첫 번째 벌이 첫 번째 셀에서 시작하고, 두 번째 벌이 n번째 셀에서 시작하는 경우를 계산합니다. 두 벌이 만날 수 있는 지점은 마찬가지로 2번 셀부터 n-1번 셀까지입니다.
5. 최대 값 계산: 각 메소드에서 반환된 최대 값을 비교합니다.
 */

public class B21758 {
}
